---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSet.ReverseIterator
source: html/7742c477-dc91-aba0-1513-a5187ff39540.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ProjectLocationSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.